import numpy as np
from lab_2 import lab_2
from lab_3 import lab_3

# Конифигурация вывода
np.set_printoptions(linewidth=320)

# Данные
A = np.array([
    [0.411, 0.421, -0.333, 0.313, -0.141, -0.381, 0.245],
    [0.241, 0.705, 0.139, -0.409, 0.321, 0.0625, 0.101],
    [0.123, -0.239, 0.502, 0.901, 0.243, 0.819, 0.321],
    [0.413, 0.309, 0.801, 0.865, 0.423, 0.118, 0.183],
    [0.241, -0.221, -0.243, 0.134, 1.274, 0.712, 0.423],
    [0.281, 0.525, 0.719, 0.118, -0.974, 0.808, 0.923],
    [0.246, -0.301, 0.231, 0.813, -0.702, 1.223, 1.105],
])
b = np.array([0.096, 1.252, 1.024, 1.023, 1.155, 1.937, 1.673])

A_0 = np.array([[0, 1], [0, 0]])
b_0 = np.array([0, 1])

# Тело программы
if __name__ == '__main__':
    print("Схема Гаусса с выбором главного элемента")
    lab_2(A, b)
    print()

    print("Метод оптимального исключения")
    lab_3(A, b)
    print()



